Revit 2027 API
FabricationPart.IsBoughtOut Property
 True if the fabrication part is bought out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBoughtOut { get; }
Public ReadOnly Property IsBoughtOut As Boolean
	Get
public:
property bool IsBoughtOut {
	bool get ();
}
member IsBoughtOut : bool with get
Property Value
Boolean
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace